# C3.1. Введение
#
# В это модуле нас ждёт много интересных и необычных вещей:
#
# * мы закончим работу с исключениями;
#
# * начнём говорить про собственные классы исключений и тонкости работы с ними;
#
# * научимся создавать собственные модули и импортировать из них необходимые данные;
#
# * разберем файлы и узнаем, как правильно записывать и читать информацию из них;
#
# * научимся создавать контекстные менеджеры двумя разными способами.
#
# Много новых и непонятных слов? Ну что ж, позвольте сделать их простыми и понятными!
